---
kind: other
id: Methods.T:Autodesk.Revit.DB.FilterCategoryRule
source: html/6670dfae-7974-3032-41fe-d89f5378ba56.htm
---
# FilterCategoryRule Methods

Checks that all of the given categories are filterable.